---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI
source: html/2f15e852-e746-b031-b4d9-d17c9771ef18.htm
---
# StructuralSectionGeneralI Members

Creates a new instance of Structural Section I Sloped Flange shape with the associated set of parameters,
 used to attach to structural element.